#1.水仙花数：计算三位整数（100～999）的水仙花数。水仙花数是指每一位的立方相加等于该数自己，比如153=1^3 + 5 ^3 + 3^3
# 2.统计字符：从键盘输入一个字符数，统计这个字符串当中包含几个大写字母，几个数字，几个特殊符号
# 3.组合问题：用1元纸币兑换1分，2分和5分硬币，要求兑换总数为50枚，问可以有多少种组合，每组组合对应1分，2分，5分分别是多少
# 4.九九乘法表，用for循环完成九九乘法表输出
# 5.数字处理：用户输入一个正整数，将该正整数倒序输出，并求各个位数相加之和（要求，不允许把用户输入的正整数处理为字符串，
# 只能按照数值运算的规律完成本题，可进一步求小数的每一位之和）
#扩转5.进一步求小数的每一位和，如1234。567，并让该小数顺序按位输出
# 6.猜数字游戏：系统随机生成1000内正整数，用户输入一个数字，如果输入数字大于系统数字则提示"大了"，反之，直到相等游戏结束，提示'通关并输出猜测次数'
# 7.字符串判断：从键盘输入一个字符串，判断该字符串是否可以被转换为一个有效数字
# 8.定义一个列表，里面包含有20个左右学生姓名，实现随机点名
# 9.给定一个列表，里面包含一批纯数字，按从小到大排序（不实用sort)

#1.求水仙花数,注意l空列表的放置位置
# l = []
# for  i  in range(100,999):
#     if i == (i//100)**3 + (i//10%10)**3 + (i%10)**3:
#         l.append(i)
# print(l)

#2.统计字符,第一种无法统计空格、大写字母和特殊字符
import re
space_ = 0
number_ = []
EnglishLowerLetter = []
EnglishUpperLetter = []
other = []

otherString = []
x = input('请输入字符：')
for i in x:
    if x == ' ':
        space_ = space_ + 1
    elif ('0' <= i <= '9'):
        number_.append(i)
    elif ('a' <= i <= 'z'):
        EnglishLowerLetter.append(i)
    elif ('A' <= x <='Z'):
        EnglishUpperLetter.append(i)
    else:
        other.append(i)
print(space_ ,number_,EnglishLowerLetter,EnglishUpperLetter,other)

'''
请输入字符：ddHHH667&&* 
0 ['6', '6', '7'] ['d', 'd'] [] ['H', 'H', 'H', '&', '&', '*', ' ']
'''




